//- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function square(a, b) {
//     return a * b;
// }
// console.log(square(10,10))

// function calc(a,b,action) {
//     if(action === '+') {
//         return a + b;
//     }
//     else if (action === '-') {
//         return a - b;
//     }
//     else {
//         return NaN
//     }
// }
//
// console.log(calc(10, 20, '*'));

// function asd () {
//     console.log(arguments);
// }
//
// asd(10,'string', true)

// function calc () {
//     if (arguments.length === 2) {
//         return arguments[0] + arguments[1]
//     }
//     else if (arguments.length === 3) {
//         return arguments[0] + arguments[1] + arguments[2]
//     }
// }
//
// console.log(calc(10,20,30));

// function asd (y, ...xxx) {
//     console.log(y, xxx[0]);
// }
// asd(100,200,300,400)



// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13